Map<String, int> letterValues = {
  'א': 1,
  'ב': 3,
  'ג': 3,
  'ד': 2,
  'ה': 1,
  'ו': 1,
  'ז': 10,
  'ח': 4,
  'ט': 4,
  'י': 1,
  'כ': 2,
  'ל': 1,
  'מ': 2,
  'נ': 1,
  'ס': 6,
  'ע': 1,
  'פ': 4,
  'צ': 8,
  'ק': 5,
  'ר': 1,
  'ש': 3,
  'ת': 1
};


class Rack 
{
  static List<String> lettersBag = [
  'א','א','א','א','א','א','א','א','א',
  'ב','ב',
  'ג','ג',
  'ד','ד','ד','ד',
  'ה','ה','ה','ה','ה','ה',
  'ו','ו','ו','ו','ו','ו',
  'ז',
  'ח','ח',
  'ט','ט',
  'י','י','י','י','י','י','י','י','י',
  'כ','כ','כ',
  'ל','ל','ל','ל',
  'מ','מ','מ',
  'נ','נ','נ','נ',
  'ס',
  'ע','ע','ע','ע',
  'פ','פ','פ',
  'צ','צ',
  'ק',
  'ר','ר','ר','ר',
  'ש','ש','ש',
  'ת','ת','ת','ת','ת','ת'
];

  List<String> letters = [];
  int size;

  Rack(this.size)
  {
    drawLetters(size);
  }

  void drawLetters(int count)
  {
    lettersBag.shuffle();

    for(int i = 0; i < count && i < lettersBag.length; i++)
    {
      letters.add(lettersBag[i]);
      lettersBag.removeAt(i);
    }


  }
}